const config = {
    trailingComma: 'es5', // Додає кому після останнього елемента в об'єктах і масивах
    semi: true, // Додає крапку з комою в кінці виразів
    singleQuote: false, // Використовує подвійні лапки для рядків
    tabWidth: 4, // Встановлює ширину табуляції на 4 пробіли
    printWidth: 120, // Встановлює максимальну ширину рядка
    bracketSpacing: true, // Додає пробіли між елементами в об'єктах
    overrides: [
      {
        files: ['*.js', '*.jsx', '*.ts', '*.tsx'], // Для цих файлів використовуємо інші налаштування
        options: {
          singleQuote: true, // Використовуємо одинарні лапки для цих файлів
        },
      },
    ],
  };
  
  export default config;